[
  {
    "id": 1,
    "text": "“元”分让我们在今生相遇，“旦”愿快乐与您相伴朝夕，“祝”福好运在您周围汇聚，“吉”使遥远却依然牵挂您，“祥”念未随时光般远去。"
  },
  {
    "id": 2,
    "text": "元旦是完美的里程碑，完美地总结了一年的收获，开始了新年的幸福;元旦是道吉祥门，关闭了一切坎坷，打开了一年的平安;元旦到，祝你元旦快乐健康!"
  },
  {
    "id": 3,
    "text": "未来可期，来年可待。"
  },
  {
    "id": 4,
    "text": "祝福您在新的一年里心想事成，一切顺利！"
  },
  {
    "id": 5,
    "text": "愿新的一年里您的生活充满欢笑和阳光！"
  },
  {
    "id": 6,
    "text": "祝福您在新的一年里事业成功，财源广进！"
  },
  {
    "id": 7,
    "text": "愿您在新的一年里精力充沛，事事顺利！"
  },
  {
    "id": 8,
    "text": "如果圣诞节你没收到我的微信，那是我在酝酿一个更大的祝福，要赶在元旦送给你。到底有多大?就地球公转一圈的size呗~没有迟到的微信，只有加倍的祝福，祝你新的一年里健康、愉快、顺利、幸运全部翻倍!"
  },
  {
    "id": 9,
    "text": "新年到，祝一帆风顺，二龙腾飞，三羊开泰，四季平安，五福临门，六六大顺，七星高照，八方来财，九九同心，十全十美。"
  },
  {
    "id": 10,
    "text": "元旦到，问个好，愿你开心困难少;青春驻，不变老，全家天天呵呵笑;儿女孝，幸福绕，忧愁全部上云霄;健康在，收入高，幸福生活乐逍遥。"
  },
  {
    "id": 11,
    "text": "愿新的一年里您的生活充满美好和温馨！"
  },
  {
    "id": 12,
    "text": "踩着风的翅膀，迎着满天的雪花，洒落你一身的祝福：一周七喜，百事可乐，万事芬达!"
  },
  {
    "id": 13,
    "text": "送你世间仅有的圆鸡蛋，坚硬的外壳；持久的蛋膜；纯色的蛋白；中间酝酿着快乐和幸福的未来，愿它成为你的幸福幸运蛋，祝你快乐过元旦！"
  },
  {
    "id": 14,
    "text": "冷的是冬季，热的是问候，愁的是忙碌，美的是收获。年终岁末，忙的是一年辛苦，乐的是辛苦一年。祝你：多喜事，硕果累累;少困苦，有滋有味!新年好!"
  },
  {
    "id": 15,
    "text": "希望你这一年比上一年过得好一点，希望你好的这部分有一点是因为我。"
  },
  {
    "id": 16,
    "text": "在温暖的风中，迎来了又一个元旦，心中的祝福送给您，我敬爱的老师，在过去的365天，您的敦敦教诲，让我进步很多。在元旦佳节之际，真心地谢谢您。"
  },
  {
    "id": 17,
    "text": "我决定送你一角钱：一分想念，一分牵挂，一分依恋，一分关心，一分开心，一分温馨，一分祝福，一份知心，一分包容，一分珍惜!"
  },
  {
    "id": 18,
    "text": "元旦到了，你想做些什么？不论做什么，请记住我的格言：笑容是良药，音乐是秘方，睡觉则可以让你忘掉一切。"
  },
  {
    "id": 19,
    "text": "元旦送你“十乐”：有事想着乐，没事偷着乐，脸上露着乐，心头藏着乐，路上走着乐，后面跟着乐，身边拥着乐，梦里抱着乐，生活太多乐，你要悠着乐!"
  },
  {
    "id": 20,
    "text": "浇开爱的花蕾，拥抱情的芳菲，新年快乐，亲爱的!"
  },
  {
    "id": 21,
    "text": "一个耳机，一杯饮料，一台电脑，我打算这样过元旦。你呢?"
  },
  {
    "id": 22,
    "text": "第一缕阳光是我对你的深深祝福，夕阳收起的最后一抹嫣红是我对你衷心的问候，在元旦来临之际，送上真挚的祝福：新年快乐!"
  },
  {
    "id": 23,
    "text": "一副副喜气对联贴门头，一声声恭贺新年不绝口，一杯杯醇香美酒端在手，一口口美味佳肴嘴中留，一条条祝福发好友，一缕缕深情绕心头。祝元旦快乐！"
  },
  {
    "id": 24,
    "text": "一元复始元旦到，新年开启第一天，祝你生活幸福数第一;学习成绩考第一;工作业绩创第一;身体健康棒第一;爱情甜蜜数第一，开心快乐数第一。"
  },
  {
    "id": 25,
    "text": "元旦了，给心情放个假。远离琐碎烦恼，携带快乐微笑，逃出繁忙，躲过压力，平静地走进问候驿站。愿你有个快乐舒适的元旦!"
  },
  {
    "id": 26,
    "text": "把祝福滚成一个圆蛋，穿过尚沙弯弯，闯过天山关关，渡过黄河滩滩，躲过大小收费站站，绕过车辆班班，来到你面前：给你圆蛋祝福，祝元旦节快乐!"
  },
  {
    "id": 27,
    "text": "敲响的是钟声，走过的是岁月，留下的是故事，带来的是希望。盼望的是美好，送来的是祝福。愿我的朋友一生平安快乐，永远幸福！祝2024年好运！"
  },
  {
    "id": 28,
    "text": "问候远方来，友谊之花开，幸福之树为你栽，吉祥如意塞满怀，祝你元旦快乐，永远可爱!"
  },
  {
    "id": 29,
    "text": "好朋友简简单单，好情谊清清爽爽，好缘份久久长长。朋友，祝你新年快乐，吉祥如意。"
  },
  {
    "id": 30,
    "text": "当你看见这贺卡时，幸运已降临到你头上，财神已进了你家门，荣华富贵已离你不远。祝福你新年快乐!"
  },
  {
    "id": 31,
    "text": "过去的一年里，你的努力犹如惊叹号，艰辛异常;你的收获好比句号，圆圆满满;你的成功就像省略号，绵延不断;新一年到来，预祝你，再接再励，来年大展身手，为事业的道路上留下辉煌的手笔!"
  },
  {
    "id": 32,
    "text": "朋友，当你忆起我的时候，也正是我想念你最深的时刻，在这想念的日子里，我想问候你近来好吗?快乐吗?祝你元旦快乐!"
  },
  {
    "id": 33,
    "text": "春节快到，我将写上健康.填上快乐.加上好运.注上平安，附上吉祥，将好运作邮票.真情作邮戳.幸福作信封，然后把它放进甜蜜的邮筒，预祝春节快乐。"
  },
  {
    "id": 34,
    "text": "新年伊始是元旦，万象更新换新颜。不再懒散拼搏干，克服困难勇向前。"
  },
  {
    "id": 35,
    "text": "元旦回首看一年，成功失败相伴生，吸取教训长经验，失败避免不重蹈，成功继续来发扬。朋友互助同努力，开创事业创辉煌。祝愿朋友都顺意，事业辉煌谱华章！"
  },
  {
    "id": 36,
    "text": "元旦到了，我收到好多人的祝福，却没有收到我最想要的他的问候。"
  },
  {
    "id": 37,
    "text": "“黎明即起，孜孜为善。”愿你热爱生命的春天，珍惜时间的清晨，学那梅花，争作“东风第一枝”。祝福串成一首诗，一段旋律开启一片温馨的天地，新年到了，祝你新年心想事成，事事如意，一切顺意!"
  },
  {
    "id": 38,
    "text": "装满一车幸福，让平安开道;抛弃一切烦恼，让快乐与你环绕;存储所有温暖，将寒冷赶跑;释放一生真情，让幸福永远微笑。元旦快乐!"
  },
  {
    "id": 39,
    "text": "请保持一种姿势：攀登;请欣赏一片风景：美丽;请拥有一份心情：快乐;请接受一声祝福：幸福。元旦到，愿你永葆美丽好心情，健康平安没烦恼!"
  },
  {
    "id": 40,
    "text": "翻翻渐薄的日历，弹弹身上的烦恼，展展开心的微笑，画画新年的草稿，想想过往的成败，谢谢朋友的关照。年年祝愿你快乐，岁岁盼你全家好!牛年快乐!"
  },
  {
    "id": 41,
    "text": "我原以为元旦会有一场轰轰烈烈的复习，但现在连作业做完都是个问题。"
  },
  {
    "id": 42,
    "text": "岁月无边年又年，过完今年望来年，今年虽然有收获，来年还要多努力。"
  },
  {
    "id": 43,
    "text": "元旦来临心情好，风景入目挑一挑，帘卷西风你莫听，夜凉如水你莫察，没事信息翻一翻，祝你好运连成串，喜上眉梢又一年。"
  },
  {
    "id": 44,
    "text": "男大当婚女大当嫁，夫妻双双传佳话；如今你已二十八，总当剩女为了啥？不如答应嫁给me，咱俩牵手来成家；成家咱俩二合一，恩恩爱爱笑哈哈。元旦快乐！"
  },
  {
    "id": 45,
    "text": "温暖祝福，入驻你身。祝你元旦快乐，幸福久久！"
  },
  {
    "id": 46,
    "text": "今天你的生活焕然一新，看：你的脸庞喜气洋洋，你的事业蒸蒸日上，你的'好运接连而至，你的口袋财源滚滚，你的人缘越来越好……今天元旦了，短信传递最美好的祝福给你，祝你元旦快乐!"
  },
  {
    "id": 47,
    "text": "元旦已到，愿你财运如沸水升腾;愿你事业麻辣烫般红火;愿你爱情像小辣椒热烈;愿你幸福像汤锅香气四溢;愿你前程像炉火越烧越旺。预祝你元旦快乐!"
  },
  {
    "id": 48,
    "text": "愿幸福挥之不去，让机遇只争朝夕，愿身体健康如一，让好运春风化雨，愿快乐如期而至，让情谊日累月积，愿片言表我心语，愿你新年阖家幸福，事事称意!"
  },
  {
    "id": 49,
    "text": "迎接除夕，惊喜无限;福星高照，福满家园;禄星进门，加爵升官;寿星贺春，寿比南山;喜神报喜，好运无限;携手众仙，共迎新年;祝你新春，吉祥美满!"
  },
  {
    "id": 50,
    "text": "元旦到，送你一件外套：口袋叫温暖;领子叫关怀;袖子叫体贴;扣子叫思念;让这件外套紧紧伴著你渡过每一分每一秒，一定要幸福喔!"
  },
  {
    "id": 51,
    "text": "元旦佳节锣鼓喧，迎来新年心喜欢。红梅艳艳报喜来，新年晚会明星艳。亲朋好友齐聚会，美酒佳肴桌上端。穿上新衣会亲戚，眉飞色舞拜新年。祝你元旦心情好，幸福喜事不会断!"
  },
  {
    "id": 52,
    "text": "欢天喜地迎元旦，吃好喝好别心烦，放松情绪心放宽，走出陋室游山川，风调雨顺心情好，忘掉烦忧身体健，关爱自己天高远，幸福吉祥保平安!"
  },
  {
    "id": 53,
    "text": "元月元日元旦至，圆梦圆心圆万事。欢快轻快更畅快，喜乐娱乐天伦乐。元旦节到了，真诚祝您幸福万年长，快乐无边疆，好运更健康!"
  },
  {
    "id": 54,
    "text": "元旦到，愿新的一年里，每个人都能不断完善自我，不断拼搏。"
  },
  {
    "id": 55,
    "text": "让元旦的欢乐驱走你生活的疲惫，让你的心灵跟随节日气氛一起陶醉;愿假期的休息带给你精力充沛，愿你节后上班信心百倍!祝你生活美丽、工作顺利!"
  },
  {
    "id": 56,
    "text": "丢掉心中的迷茫，抹去眼里的忧伤，祝新年如意!新的一年新的路，走吧，鲜花正盛开在的`前方!"
  },
  {
    "id": 57,
    "text": "祝福您在新的一年里拥有美好的回忆！"
  },
  {
    "id": 58,
    "text": "电话、手机、计算机，朋友之间传信息;新年、新春、新景象，祝福朋友皆安康。祝你元旦快乐!"
  },
  {
    "id": 59,
    "text": "新年到了，愿你生活过得开心，工作干得顺心，身体长得舒心，情人爱得痴心，朋友交得真心，元旦快乐，元旦快乐！"
  },
  {
    "id": 60,
    "text": "新年又要来到，忘掉忧愁烦恼;世间纷纷扰扰，心态健康重要;早上吃好吃饱，晚上洗脸洗脚;闲时弄弄花草，喝到适量就好;爱是快乐小鸟，保你青春不老。"
  },
  {
    "id": 61,
    "text": "新年快乐，即便我不能在当面对你说一句新年快乐。"
  },
  {
    "id": 62,
    "text": "春节是亘古的梦想，亘古是梦想的记忆，梦想是记忆的永恒，记忆是永恒的情结，永恒是情结的凝聚，情结是凝聚的深情，深情是新年的祝福。"
  },
  {
    "id": 63,
    "text": "为你点上新年的红烛，愿你日子顺心多平安；为你绽放新年的烟火，愿你事情顺心多富贵；为你吟唱新年的颂歌，愿你生活美满快乐多；为你送上新年的祝福，祝你梦想成真幸福多。祝你元旦快乐！"
  },
  {
    "id": 64,
    "text": "时间记录着你的脚步，业绩肯定了你的努力。所有的骄傲和成功都是留在过去的一年里，新的一年即将开始，让我们在新的起跑线上再次拼搏，愿你能拥有更辉煌的明天。"
  },
  {
    "id": 65,
    "text": "阔别多日，愿在这祥和的春节里带给你快乐无数!祝你春节过得开心!"
  },
  {
    "id": 66,
    "text": "如果去年陪你过元旦的人还在你身边，你就是幸福的。"
  },
  {
    "id": 67,
    "text": "执手共赴新年，驱逐酸甜苦辣。让我陪你四季如春，岁月如歌；追逐梦想，快乐无疆。祝你新年快乐！"
  },
  {
    "id": 68,
    "text": "愿你前途光明，幸福展笑颜。"
  },
  {
    "id": 69,
    "text": "愿新的一年里您的梦想飞翔，无所不能！"
  },
  {
    "id": 70,
    "text": "祝福您新年欢欢喜喜，幸福美满！"
  },
  {
    "id": 71,
    "text": "大财，小财，意外财，财源滚滚;亲情，友情，爱情，情情如意官运;福运，财运，桃花运，运运亨通。元旦到来之际，送上我最真挚的祝福：元旦快乐!"
  },
  {
    "id": 72,
    "text": "如果缘分是一片汪洋，朋友便是那乘风的船;如果想念是一座高山，祝福便是那如茵的草本。元旦之夜祝亲爱得朋友在新的一年里万事如意。"
  },
  {
    "id": 73,
    "text": "感谢你的关怀，感谢你的帮助，感谢你对我所做的一切。请接受我新年的祝愿，祝你平安幸福!"
  },
  {
    "id": 74,
    "text": "信息就像糖果，偶尔来一颗，甜啊!但糖吃多了，腻啊!怕你烦，所以我只偶尔给你一颗糖，这不代表我不重视你，因为我会把最甜的一颗给你哦：新年快乐!"
  },
  {
    "id": 75,
    "text": "祝福您在新的一年里拥有一个充满希望的未来！"
  },
  {
    "id": 76,
    "text": "新年到、元旦到、有成绩、别骄傲、失败过、别死掉、齐努力、开大炮、好运气、天上掉、同分享、大家乐。天天好运道，日日福星照!"
  },
  {
    "id": 77,
    "text": "愿新的一年里您的工作顺利，事业腾飞！"
  },
  {
    "id": 78,
    "text": "愿新的一年里您的生活美满幸福！"
  },
  {
    "id": 79,
    "text": "元旦到了有段子，红红火火好日子，锣鼓喧天庆贺子，欢欢乐乐吼歌子，堂堂正正走路子，潇潇洒洒赚票子，健健康康好身子，年年都是靓样子，幸福快乐一辈子!"
  },
  {
    "id": 80,
    "text": "鸡蛋鸭蛋，营养不如毛蛋！好蛋坏蛋，千万别当傻蛋！金蛋银蛋，朋友间不能孤单！祝你元旦快乐！"
  },
  {
    "id": 81,
    "text": "新年的喜庆如月光，照亮千万家;快乐的味道如糖果，甜蜜你心间;思念的温馨似棉被，温暖你身心;问候的传递载祝福，送到你眼前。祝你新年快乐，幸福安康。"
  },
  {
    "id": 82,
    "text": "新年钟声敲，吹响快乐集结号。祝福紧急集合，短信来报到。快乐戴上开心帽，幸福做回指导员，吉祥平安都站好，温馨甜蜜别乱跑，新年祝福就送到!"
  },
  {
    "id": 83,
    "text": "老婆很爱老公，但是老婆知道老婆有时候没有老公那么细心，对老公关心不够，所以老婆一定会多关心老公的！老公，元旦快乐！"
  },
  {
    "id": 84,
    "text": "开心的锣鼓敲起来，吉祥的唢呐吹起来，欢快的歌声唱出来，喜庆的舞蹈扭起来，愿君快快乐乐，幸幸福福，开开心心，健健康康过元旦!"
  },
  {
    "id": 85,
    "text": "愿我的祝福能带给你快乐的新年!愿吉祥之光普照你的每一个日子!愿阳光和鲜花洒满你的人生旅程!祝你新年快乐!"
  },
  {
    "id": 86,
    "text": "古人云：朋友不单是谈笑风声，还会分担烦恼。不能与你常见面，但对这友情始终不变。没有经常联络你，而是将你藏在心里，祝你元旦节快乐!"
  },
  {
    "id": 87,
    "text": "轻轻的一声问候，深深的一捧祝福，绵绵的一串关怀，都道不尽心中的感慨。新的一年来临，千言万语都凝集在这一条短信，祝你元旦节快乐，永远幸福!"
  },
  {
    "id": 88,
    "text": "祝福您在新的一年里好运连连，财源滚滚！"
  },
  {
    "id": 89,
    "text": "祝心宽体不胖，财旺运道强，元旦属你最靓!"
  },
  {
    "id": 90,
    "text": "愿您的事业蒸蒸日上，在新的一年里取得更大的成就！"
  },
  {
    "id": 91,
    "text": "短信发货，幸福敲门。白虎出屏，祝福主人：福禄寿喜，结伴成行；父母安康，妻子美容，孩子争气，朋友真诚；平安到家，一顺百顺。快乐签单，新年快乐！"
  },
  {
    "id": 92,
    "text": "太阳给你温暖，月亮给你温馨，我给你祝福，新年大吉!"
  },
  {
    "id": 93,
    "text": "匆匆，太匆匆，时间如水无影踪。花开花谢又一年，转眼白雪飘飘覆万物。春节佳节倍思亲，愿你吉星高照幸福临。祝你健康快乐永相随!"
  },
  {
    "id": 94,
    "text": "快过年了，有没有一个人，你想见却见不到?"
  },
  {
    "id": 95,
    "text": "爱你是我的荣幸，娶你是我的目的，新年快乐，亲爱的!"
  },
  {
    "id": 96,
    "text": "元旦来临喝杯酒，愿你好运天天有，元旦有空访访友，愿你开心无烦忧，元旦在家歇一歇，精神抖擞有没有？元旦祝福送到手，吉祥如意全都有。"
  },
  {
    "id": 97,
    "text": "新年人人忙许愿，求财盼缘不停歇，咱的愿望最简单，只求博你红颜一笑!"
  },
  {
    "id": 98,
    "text": "聚喜玛拉雅之阳光，拢天涯海角之清风，拮冈底斯山之祝福，吸比尔盖茨之财气，作为礼物送给你，祝你新年快乐!"
  },
  {
    "id": 99,
    "text": "寒冷透刺骨髓，阳光依然明媚，寒冷与温暖交织，辞旧迎新在今日，告别成绩斐然的2024，迎来了充满希望的2024，我们满怀信心，去迎接新的挑战，愿公司前途美好，新老朋友天天欢笑!"
  },
  {
    "id": 100,
    "text": "祝福您在新的一年里闪耀光芒，成为更好的自己！"
  },
  {
    "id": 101,
    "text": "陈年老友，恭喜发财!出门在外，岁岁平安!常回家看看，生活更甜甜!"
  },
  {
    "id": 102,
    "text": "愿新年为您带来无尽的好运和好事！"
  },
  {
    "id": 103,
    "text": "新的一年，愿您抱着平安，拥着健康，揣着幸福，携着快乐，搂着温馨，带着甜蜜，带着财运，拽着吉祥，迈入新年，快乐度过每一天!"
  },
  {
    "id": 104,
    "text": "畅饮元旦这杯酒，醉回忆醉拥有，亲朋好友齐庆祝，甜美幸福绕心头，妻贤子孝事业火，开心快乐好生活。祝你元旦愉快。"
  },
  {
    "id": 105,
    "text": "祝你万事如意了，一生永远无烦恼！"
  },
  {
    "id": 106,
    "text": "元旦放假要多乐：祝愿我的朋友，身体健康，乐;幸福无疆，乐;事业辉煌，乐;好运连绵，乐;永远平安，乐;心想事成，乐;生活美满，乐;爱情甜蜜，乐!"
  },
  {
    "id": 107,
    "text": "春天的钟声响，新年的脚步迈，祝新年的钟声，敲响你心中快乐的音符，幸运与平安，如春天的脚步紧紧相随!春华秋实，我永远与你同在!"
  },
  {
    "id": 108,
    "text": "愿新年带来成功和繁荣，使您的梦想成为现实！"
  },
  {
    "id": 109,
    "text": "愿新的一年里您的每个日子都充满欢笑和阳光！"
  },
  {
    "id": 110,
    "text": "新年新开端，首选是元旦。立志好人缘，天天露笑脸。一定要有钱，归隐山水间。健康常相伴，饮食加锻炼。好运在狗年，快乐过元旦。祝：元旦快乐!"
  },
  {
    "id": 111,
    "text": "元旦已来到，祝福莫迟到。爱情甜蜜蜜，友情似海深，家人喜洋洋，事业更辉煌。天降大红包，恭喜发财步步高。"
  },
  {
    "id": 112,
    "text": "元旦过节我送礼，送个财神祝福你，金气银气跟随你;元旦过节我送礼，送个福神抱着你，福气运气追随你;元旦过节我送礼，送个寿神拉着你，矫健安康伴随你;元旦过节我送礼，再送幸福包围你。元旦快乐!美满!"
  },
  {
    "id": 113,
    "text": "元旦到了，愿你：给道路一个脚印，留下平安的足迹，给身体一个拥抱，留下健康的气息，给工作一个飞吻，留下成就的蜜意，给希望一分环绕，留下完美的传奇。过去幸福是你，未来顺利是你。祝元旦快乐!"
  },
  {
    "id": 114,
    "text": "洋洋喜气热热闹闹喜迎牛年，年年牛年欢欢乐乐心想事成!"
  },
  {
    "id": 115,
    "text": "祝你新年快乐，运气像雨点一样密集，幸福像蜂蜜一样甜美!"
  },
  {
    "id": 116,
    "text": "缘聚新年，愿好运相伴，快乐常驻，幸福蔓延；生活美满，工作顺利，家庭温馨，新年快乐！"
  },
  {
    "id": 117,
    "text": "新年天气预报：你将会遇到金钱雨、幸运风、雾、爱情露、霞、幸福云、顺利霜、美满雷、安全雹、开心闪、它们将伴你整一年!"
  },
  {
    "id": 118,
    "text": "愿你幸福做加法，烦恼做减法，快乐做乘法，困难做除法，幸运开平方，霉运开根号，坏心情像小数点，好心情循环无极限。祝元旦快乐！"
  },
  {
    "id": 119,
    "text": "福气多多!十全十美!万福重叠福星高照!祝你新年快乐!"
  },
  {
    "id": 120,
    "text": "浓浓的情谊与祝福，绵绵的思念与问安，在这美好的日子，愿祝愿随着卡片带给你温馨的问候，盼你能时常想到我，也希望你能知道，无论天涯海角我都深深祝福你!新年快乐!"
  },
  {
    "id": 121,
    "text": "昨夜星辰昨夜梦，今日许愿今日圆，日出东方曙光现，幸福就在你身边，福星高照艳阳天，欢声笑语乐心田，良辰好景庆元旦，岁岁年年送祝愿，元旦到了，祝你在新的一年里事事顺利，快乐每一天。"
  },
  {
    "id": 122,
    "text": "元旦转瞬到眼前，提早给你拜个年，祝你风风火火招财年，顺顺利利如意年，开开心心好运年，快快乐乐欢喜年，平平安安吉祥年，团团圆圆幸福年!"
  },
  {
    "id": 123,
    "text": "鸿图万象，福至心开。衷心祝福您新年快乐，心想事成，福禄寿美满，阖家欢乐，事事如意！"
  },
  {
    "id": 124,
    "text": "美事跟着你，金钱贴着你，贵人帮助你，祸事躲着你，小人绕着你，爱人念着你，家人挂着你，上天保佑你，我在祝福你。春节快乐!"
  },
  {
    "id": 125,
    "text": "朝阳是新生的力量，督促奋斗的人前进;初恋是懵懂的情愫，牵绊相爱的人心上;元旦是新年的伊始，带来等待的人希望。朋友，元旦快乐!"
  },
  {
    "id": 126,
    "text": "数小时后，新年钟声即将在世界范围内敲响。愿我的衷心的祝福，随着一声声钟鸣，一次次飘到你的身边。祝你新年快乐!"
  },
  {
    "id": 127,
    "text": "愿新年为您带来幸福快乐与健康！"
  },
  {
    "id": 128,
    "text": "过去是用来留恋的，岁月是用来怀念的，未来是用来畅想的，现在是用心把握的，幸福是用汗水创造的，春节是用来庆祝的。新的一年愿您敞开心扉，拥抱快乐!"
  },
  {
    "id": 129,
    "text": "愿新年给您带来满满的温馨和幸福！"
  },
  {
    "id": 130,
    "text": "老师是学生的第二个“妈妈”。老师，你的春节就是哈哈哈生日！老师您辛苦了，送给您一份温馨的祝福。"
  },
  {
    "id": 131,
    "text": "祝福您在新的一年里幸福安康！"
  },
  {
    "id": 132,
    "text": "元旦来临，我的祝福如同那纷纷扬扬的大雪，无比纯洁;如同那辞旧迎新的钟声，无比浑厚;如同那一枚冬眠的种子，不知不觉间就长成了大树，结满了快乐!"
  },
  {
    "id": 133,
    "text": "元旦快乐，愿您新年交好运，健康又平安，吉祥又如意，万事都顺心!"
  },
  {
    "id": 134,
    "text": "心情的欢悦，新年的喜悦，思念的愉悦，祝福的微信为你跳跃，温馨的笑容为你取悦，美好的愿望为你腾跃，提前祝你新年天天看好，成功之门等你跃!"
  },
  {
    "id": 135,
    "text": "千帆竞发百舸流，事业路上竞风流。不怕吃苦不怕累，一年到头不停留。硕果累累人称赞，掌声之中泪花流。汗水铺就成功路，拼搏才能数风流。愿你再接再厉不骄傲，工作努力创辉煌!"
  },
  {
    "id": 136,
    "text": "奔波一年又一年，道句辛苦了。携手一天又一天，说声感谢了。走过一程又一程，终点变起点。人生一站又一站，日子苦也甜。元旦将至，祝你幸福平安!"
  },
  {
    "id": 137,
    "text": "元旦就来到，我的祝福到，天天开心笑，日日数钞票，老板对您笑，加薪给红包，美女抛绣球，专打您发梢，躲都躲不掉，逃也逃不了，2024新年快乐！"
  },
  {
    "id": 138,
    "text": ""
  },
  {
    "id": 139,
    "text": "元旦是句号，总结以往的美好;元旦是冒号，开启成功的预兆;元旦是感叹号，吹响未来号角;元旦是省略号，省略掉郁闷烦恼。祝你新年画满幸福符号!元旦幽默祝福短信。"
  },
  {
    "id": 140,
    "text": "在新的一年里，让我们共同来祝福彼此，新年快乐!元旦快乐!新的开始新希望，新的一天新阳光。"
  },
  {
    "id": 141,
    "text": "祝福您在新的一年里找到属于自己的幸福！"
  },
  {
    "id": 142,
    "text": "一家和和睦睦，一年开开心心，一生快快乐乐，一世平平安安，天天精神百倍，月月喜气洋洋，年年财源广进。新春快乐!"
  },
  {
    "id": 143,
    "text": "在这辞旧迎新之际，元旦出来献礼，愿你在新的一年发扬以健康开心为基本中心，以幸福和快乐为两个基本点，牢牢抓住刻苦努力，成功第一不动摇。更重要的一条就是元旦要快乐哦。"
  },
  {
    "id": 144,
    "text": "钟声是我的问候，歌声是我的祝福，雪花是我的贺卡，美酒是我的飞吻，清风是我的拥抱，快乐是我的礼物!统统都送给你，祝你元旦快乐!"
  },
  {
    "id": 145,
    "text": "愿新的一年里您拥有一个美好的家庭！"
  },
  {
    "id": 146,
    "text": "愿你事业八面圆通，爱情花好月圆，亲朋团团圆圆，生活玉润珠圆，好运源源不断。元旦快乐!"
  },
  {
    "id": 147,
    "text": "一元复始又一年，旦阳冉升新一天。"
  },
  {
    "id": 148,
    "text": "新年伊始万象更新，新年的曙光已经扑面而来!无论明天路上多少荆棘坎坷，让我们伴随悠扬的新年钟声，携起手来少一些埋怨多一些行动，坚定信心振奋精神扎实苦干，发挥我们所有的智慧和能量，奉献我们所有的激情和才华，再谱公司和个人发展的崭新篇章!"
  },
  {
    "id": 149,
    "text": "年关年关，情场职场名利场，场场顺利通关；年末年末，爱人友人家里人，人人相濡以沫；年底年底，家事国事天下事，事事顺心如意。元旦将至，我要把所有好运收集，一次性发射给您：小样，您就等着被幸福偷袭吧！"
  },
  {
    "id": 150,
    "text": "没有永远的顺境，也没有永远的逆境，不管什么样的环境，只要保持好的心境，就能抵达快乐的仙境。又到元旦，愿你穿过甜美梦境，拥抱幸福胜境!"
  },
  {
    "id": 151,
    "text": "工作轻松无恼，工资愈涨愈高。祝你新年欢笑，福星高照!"
  },
  {
    "id": 152,
    "text": "愿新年给您的生活带来更多精彩和惊喜！"
  },
  {
    "id": 153,
    "text": "新春佳节到，拜年要赶早，好运跟你跑，吉祥围你绕，财源进腰包，心想事成了，新春齐欢笑!我的祝福如此早，请你一定收到。"
  },
  {
    "id": 154,
    "text": "忘掉烦恼，抛弃忧愁;展望美好，迎接新年;年末虽冷，快乐依然!"
  },
  {
    "id": 155,
    "text": "祝元旦节日开心时时、快乐天天、幸福年年。"
  },
  {
    "id": 156,
    "text": "元旦像一管空灵的笛声，穿越美好的思念和幸福相逢。亲爱的朋友，元旦快乐。"
  },
  {
    "id": 157,
    "text": "现代中医认为：相思瞌睡少，暗恋心不老，调情解烦恼，花心练大脑，偷情心脏好，泡妞抗衰老!以科学发展观的态度对照自己，有则实践，无则发展，祝新春好!春节更好!"
  },
  {
    "id": 158,
    "text": "祝福您在新的一年里事业有成，前途无限！"
  },
  {
    "id": 159,
    "text": "久不联系，想念你，元旦特别想念你；久不见面，思念化祝福，元旦发给你；每一个久久不见面的日子，打包成方方正正的祝福字体，在远远地方祝你，元旦快乐，团圆快乐！"
  },
  {
    "id": 160,
    "text": "恭喜你，用一年的努力，换来成功的收成，财富跟你签约，喜悦与你相拥，新的一年到来，特地为你预订了来年的好运，愿你加油鼓劲，与勤劳为伍，最终握住胜利的手!"
  },
  {
    "id": 161,
    "text": "辞旧迎新元旦到，祝福赶忙报个到，快乐进入人生道，幸福惬意心里倒，事业登上好运岛，生活舞出吉祥蹈，元旦到，愿你福到，运到，开心到，元旦快乐。"
  },
  {
    "id": 162,
    "text": "元旦，愿你告别过去的懒散，拥抱明日的辉煌，努力进取，开创幸福新生活，元旦快乐!"
  },
  {
    "id": 163,
    "text": "接下来的元旦、春节、情人节、元宵节，不知道我地址的各位，请联系我。"
  },
  {
    "id": 164,
    "text": "新年的雪花飘飘洒洒，新年的脚步滴滴答答，新年的爆竹劈劈啪啪，新年的烟花雾里看花，新年的祝福稀里哗啦，我的问候准时送达，来年的你肯定大发!"
  },
  {
    "id": 165,
    "text": "祝福是你我彼此的问候，一年一度的元旦，愿你有不同的精彩，演绎人生。"
  },
  {
    "id": 166,
    "text": "又是一年，时间又一次停靠春节驿站，跟过去的一年告别，向未来的一年祈愿，感受岁月无情流逝，心中又升腾起新的希望。让我们拥抱春节，共赴未来!"
  },
  {
    "id": 167,
    "text": "一个人过圣诞，一个人跨年，一个人过元旦，一个人对着一部手机想着另一个人。"
  },
  {
    "id": 168,
    "text": "阴转晴，晴转阴，又出太阳又结冰。元旦节，假期近，祝你玩得舒心，吃得开心、想起顶心，忘记伤心，收到我祝福顿时和我心心相印!"
  },
  {
    "id": 169,
    "text": "也许岁月将往事退色，或许空间将彼此隔离，但知道珍惜的依然是真心的友谊将再次对你说声新年快乐!"
  },
  {
    "id": 170,
    "text": "走自己的路，让别人打车去吧。穿别人的鞋，让他们光脚去吧。现在就送给您新年的祝福，让别人羡慕去吧。新年快乐!"
  },
  {
    "id": 171,
    "text": "元旦驾到，欢喜进门，小假来到，心情甚好;朋友祝福，添个作料，假期舒心，玩得称心;新年开始，工作顺心，薪水合心，被窝暖心。祝元旦无比开心!"
  },
  {
    "id": 172,
    "text": "愿新的一年里您能收获满满的幸福和快乐！"
  },
  {
    "id": 173,
    "text": "元旦佳节到，向你问个好；身体倍健康，心情特别好；好运天天交，口味顿顿妙；家里出黄金，墙上长钞票。"
  },
  {
    "id": 174,
    "text": "新的一年开始，祝好事接二连三，心情四季如春，生活五颜六色，七彩缤纷，偶尔八点小财，烦恼抛到九霄云外!请接受我十心十意的祝福。祝新春快乐!"
  },
  {
    "id": 175,
    "text": "新的一年又是一个新的开始，所有的人元旦快乐。"
  },
  {
    "id": 176,
    "text": "将离别的骊歌唱响，把前进的赞歌悠扬。昨天已把烦恼清光，今天且把快乐带上，元旦到，愿你向着幸福远方，一路走一路唱，一生安康!"
  },
  {
    "id": 177,
    "text": "把最美好的祝福，输在这条短信里，信不长情意重，好久不见，十分想念。在这温馨的日子里，常常忆起共处的岁月。祝新年快乐！元旦幸福！"
  },
  {
    "id": 178,
    "text": "又是一年元旦到，元旦祝福不可少；送你一片青青草，愿你人生永不老；送你一只吉祥号，愿你来年步步高；送你一声新年好，愿你好运时时扰。元旦提前快乐。"
  },
  {
    "id": 179,
    "text": "祝您新年充满喜悦与和平！"
  },
  {
    "id": 180,
    "text": "元旦，圆满结束一年，开始新的一年，一起努力，再接再厉。"
  },
  {
    "id": 181,
    "text": "新年的祝福，平日的希冀，愿你心境祥和、充满爱意，愿你的世界全是美满，愿你一切称心如意，快乐无比。"
  },
  {
    "id": 182,
    "text": "愿生活，当下如水，未来如诗。"
  },
  {
    "id": 183,
    "text": "所谓幸福是一个有健康的身体，有深爱你的人，一帮可依赖的朋友，当你收到此信息时，一切随之拥有。元旦快乐！"
  },
  {
    "id": 184,
    "text": "祝好运永远伴你左右!并祝你天天快快乐乐!开开心心!"
  },
  {
    "id": 185,
    "text": "新年快乐!万事大吉!合家欢乐!财源广进!恭喜发财!"
  },
  {
    "id": 186,
    "text": "愿新的一年给您带来健康与快乐！"
  },
  {
    "id": 187,
    "text": "祝您新年万事如意，事业蒸蒸日上！"
  },
  {
    "id": 188,
    "text": "元旦已来到，心情如蝶舞。祝福送给你，愿你展笑颜，踏上悠闲路!"
  },
  {
    "id": 189,
    "text": "愿甜蜜伴您走过新年中的每一天，愿温馨随您走过一天中的每一时，愿平安同您走过每一时中的每一分，愿快乐同您走过每一分钟中的每一秒。"
  },
  {
    "id": 190,
    "text": "你的快乐，生我的微笑;你的美丽，生我的幸福;你的故事，生我们的传奇;亲爱的，元旦快乐，让一切重新开始!"
  },
  {
    "id": 191,
    "text": "快乐像学校加班越来越多，烦恼像学校福利越来越少，友谊像领导讲话越来越长，祝福像突击检查说到就到，祝您新年快乐!"
  },
  {
    "id": 192,
    "text": "我收到了一包“幸运糖”，很想与你一起分享。我精心挑选了“平安”“幸福”和“健康”，送给你尝一尝。元旦快乐!"
  },
  {
    "id": 193,
    "text": "新年快乐!事业顺心顺意，工作顺顺利利，爱情甜甜蜜蜜!身体有用不完的力气，滚滚财源广进!身体倍儿棒，吃饭倍儿香，牙好胃口就好，事事开心，事事顺利!"
  },
  {
    "id": 194,
    "text": "新出炉的短信，带着热腾腾的福气，滚烫烫的好运，香喷喷的吉祥，作为你团圆饭上的一道佳肴，吃了身体棒棒的，心里暖暖的。元旦快乐!"
  },
  {
    "id": 195,
    "text": "新年的钟声即将敲响，愿你快乐伴随每一天。飞跃在往后的日子里，向幸福发出最炫丽的音符。祝福你新年快乐，越努力，越加辉煌！"
  },
  {
    "id": 196,
    "text": "元旦驾到，为了表示对你的爱，我决定圆你一个美丽的梦，但求你快乐；圆你一个五彩的梦，但求你幸福；圆你一个甜蜜的梦，但求你如意；圆你一个温暖的梦，但求你成功。元旦快乐。"
  },
  {
    "id": 197,
    "text": "新年就有新的希望，吉祥如意团团围绕。新年必有新的气象，幸福快乐紧紧相拥。"
  },
  {
    "id": 198,
    "text": "元旦到了，送你三块巧克力：第一块德芙，望你得到天下所有的幸福；第二块金帝，祝你在金色年华过着帝王的生活；第三块吉百利，祝你吉年百事顺利！"
  },
  {
    "id": 199,
    "text": "元旦到，送礼太俗套，祝福没花招，只有祝愿亲爱的朋友们：天天被财神爷骚扰，时时被弥勒佛普照，大把赚钞票，快乐哈哈笑，幸福跟着跑。元旦快乐!"
  }
]